--- String parsing is incomplete (should demand complete parse)
0> (display "error )
"ERROR 1> 
2> 

-- String parsing buggy, try quoted strings:
  repl> (display "hey \"ha\" ho")
but from a file does not work too well

--- Error in parsing chained commands
0> (display "one\n") (display "two\n")
one
1>

-- String with ( and ) does not work
2> (display "a (b) c\n")
"A C\N"3> 
